Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg55/atdf/ATSAMG55J19.atdf
        <module name="RSTC" id="11009" version="I">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1400"/>
            <parameters>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="6056" version="T">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1460"/>
            <parameters>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="RTT" id="6081" version="M">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1430"/>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="SPI" id="11279" version="D">
          <instance name="SPI0">
            <register-group address-space="base" name="SPI0" name-in-module="SPI" offset="0x4000C400"/>
            <signals>
              <signal pad="PA9" function="A" group="SPI0_MISO"/>
              <signal pad="PB0" function="A" group="SPI0_SPCK"/>
              <signal pad="PA25" function="A" group="SPI0_NPCS" index="0"/>
              <signal pad="PA26" function="A" group="SPI0_NPCS" index="1"/>
              <signal pad="PA10" function="A" group="SPI0_MOSI"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="24"/>
              <param name="DMAC_ID_RX" value="10"/>
            </parameters>
          </instance>
          <instance name="SPI1">
            <register-group address-space="base" name="SPI1" name-in-module="SPI" offset="0x40020400"/>
            <signals>
              <signal pad="PB2" function="A" group="SPI1_MISO"/>
              <signal pad="PA27" function="A" group="SPI1_SPCK"/>
              <signal pad="PA28" function="A" group="SPI1_NPCS" index="0"/>
              <signal pad="PA29" function="A" group="SPI1_NPCS" index="1"/>
              <signal pad="PB3" function="A" group="SPI1_MOSI"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="23"/>
              <param name="DMAC_ID_RX" value="9"/>
            </parameters>
          </instance>
          <instance name="SPI2">
            <register-group address-space="base" name="SPI2" name-in-module="SPI" offset="0x40024400"/>
            <signals>
              <signal pad="PA5" function="A" group="SPI2_MISO"/>
              <signal pad="PA15" function="B" group="SPI2_SPCK"/>
              <signal pad="PA24" function="B" group="SPI2_SPCK"/>
              <signal pad="PA16" function="A" group="SPI2_NPCS" index="0"/>
              <signal pad="PA15" function="A" group="SPI2_NPCS" index="1"/>
              <signal pad="PA6" function="A" group="SPI2_MOSI"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="22"/>
              <param name="DMAC_ID_RX" value="8"/>
            </parameters>
          </instance>
          <instance name="SPI3">
            <register-group address-space="base" name="SPI3" name-in-module="SPI" offset="0x40018400"/>
            <signals>
              <signal pad="PA4" function="A" group="SPI3_MISO"/>
              <signal pad="PB13" function="A" group="SPI3_SPCK"/>
              <signal pad="PB14" function="A" group="SPI3_NPCS" index="0"/>
              <signal pad="PB15" function="A" group="SPI3_NPCS" index="1"/>
              <signal pad="PA3" function="A" group="SPI3_MOSI"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="17"/>
              <param name="DMAC_ID_RX" value="0"/>
            </parameters>
          </instance>
          <instance name="SPI4">
            <register-group address-space="base" name="SPI4" name-in-module="SPI" offset="0x4001C400"/>
            <signals>
              <signal pad="PB9" function="A" group="SPI4_MISO"/>
              <signal pad="PB11" function="A" group="SPI4_MISO"/>
              <signal pad="PB1" function="A" group="SPI4_SPCK"/>
              <signal pad="PB8" function="B" group="SPI4_NPCS" index="0"/>
              <signal pad="PB9" function="B" group="SPI4_NPCS" index="1"/>
              <signal pad="PB8" function="A" group="SPI4_MOSI"/>
              <signal pad="PB10" function="A" group="SPI4_MOSI"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="26"/>
              <param name="DMAC_ID_RX" value="12"/>
            </parameters>
          </instance>
          <instance name="SPI5">
            <register-group address-space="base" name="SPI5" name-in-module="SPI" offset="0x40008400"/>
            <signals>
              <signal pad="PA12" function="A" group="SPI5_MISO"/>
              <signal pad="PA14" function="A" group="SPI5_SPCK"/>
              <signal pad="PA11" function="A" group="SPI5_NPCS" index="0"/>
              <signal pad="PA5" function="B" group="SPI5_NPCS" index="1"/>
              <signal pad="PB2" function="B" group="SPI5_NPCS" index="1"/>
              <signal pad="PA13" function="A" group="SPI5_MOSI"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="27"/>
              <param name="DMAC_ID_RX" value="13"/>
            </parameters>
          </instance>
          <instance name="SPI6">
            <register-group address-space="base" name="SPI6" name-in-module="SPI" offset="0x40040400"/>
            <signals>
              <signal pad="PB1" function="B" group="SPI6_MISO"/>
              <signal pad="PB11" function="B" group="SPI6_MISO"/>
              <signal pad="PB13" function="B" group="SPI6_SPCK"/>
              <signal pad="PB14" function="B" group="SPI6_NPCS" index="0"/>
              <signal pad="PB15" function="B" group="SPI6_NPCS" index="1"/>
              <signal pad="PB0" function="B" group="SPI6_MOSI"/>
              <signal pad="PB10" function="B" group="SPI6_MOSI"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="25"/>
              <param name="DMAC_ID_RX" value="11"/>
            </parameters>
          </instance>
          <instance name="SPI7">
            <register-group address-space="base" name="SPI7" name-in-module="SPI" offset="0x40034400"/>
            <signals>
              <signal pad="PA27" function="B" group="SPI7_MISO"/>
              <signal pad="PA29" function="B" group="SPI7_SPCK"/>
              <signal pad="PA30" function="B" group="SPI7_NPCS" index="0"/>
              <signal pad="PA31" function="B" group="SPI7_NPCS" index="1"/>
              <signal pad="PA28" function="B" group="SPI7_MOSI"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="29"/>
              <param name="DMAC_ID_RX" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="11228" version="G">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1410"/>
            <signals>
              <signal pad="PA0" function="X1" group="WKUP" index="0"/>
              <signal pad="PA1" function="X1" group="WKUP" index="1"/>
              <signal pad="PA2" function="X1" group="WKUP" index="2"/>
              <signal pad="PA3" function="X1" group="WKUP" index="9"/>
              <signal pad="PA4" function="X1" group="WKUP" index="10"/>
              <signal pad="PA5" function="X1" group="WKUP" index="4"/>
              <signal pad="PA8" function="X1" group="WKUP" index="5"/>
              <signal pad="PA9" function="X1" group="WKUP" index="6"/>
              <signal pad="PA14" function="X1" group="WKUP" index="8"/>
              <signal pad="PA16" function="X1" group="WKUP" index="7"/>
              <signal pad="PA23" function="X1" group="WKUP" index="3"/>
              <signal pad="PA24" function="X1" group="WKUP" index="11"/>
              <signal pad="PB2" function="X1" group="WKUP" index="12"/>
              <signal pad="PB3" function="X1" group="WKUP" index="13"/>
              <signal pad="PB8" function="X1" group="WKUP" index="14"/>
              <signal pad="PB9" function="X1" group="WKUP" index="15"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="6082" version="ZB">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40010000"/>
            <signals>
              <signal pad="PA2" function="A" group="TCLK" index="0"/>
              <signal pad="PA19" function="A" group="TCLK" index="1"/>
              <signal pad="PA20" function="A" group="TCLK" index="2"/>
              <signal pad="PA0" function="B" group="TIOA" index="0"/>
              <signal pad="PA23" function="B" group="TIOA" index="1"/>
              <signal pad="PA21" function="A" group="TIOA" index="2"/>
              <signal pad="PA1" function="B" group="TIOB" index="0"/>
              <signal pad="PA16" function="B" group="TIOB" index="1"/>
              <signal pad="PA22" function="A" group="TIOB" index="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="14"/>
              <param name="INSTANCE_ID_CHANNEL0" value="23"/>
              <param name="INSTANCE_ID_CHANNEL1" value="24"/>
              <param name="INSTANCE_ID_CHANNEL2" value="25"/>
              <param name="CLOCK_ID_CHANNEL0" value="23"/>
              <param name="CLOCK_ID_CHANNEL1" value="24"/>
              <param name="CLOCK_ID_CHANNEL2" value="25"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="MCK/2"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="PCK3"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="16"/>
              <param name="QDEC_PRESENT" value="0"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40014000"/>
            <parameters>
              <param name="INSTANCE_ID_CHANNEL0" value="26"/>
              <param name="INSTANCE_ID_CHANNEL1" value="27"/>
              <param name="INSTANCE_ID_CHANNEL2" value="28"/>
              <param name="CLOCK_ID_CHANNEL0" value="26"/>
              <param name="CLOCK_ID_CHANNEL1" value="27"/>
              <param name="CLOCK_ID_CHANNEL2" value="28"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="MCK/2"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="PCK3"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="16"/>
              <param name="QDEC_PRESENT" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="TWI" id="11280" version="C">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWI" offset="0x4000C600"/>
            <signals>
              <signal pad="PA9" function="A" group="TWCK"/>
              <signal pad="PA10" function="A" group="TWD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="24"/>
              <param name="DMAC_ID_RX" value="10"/>
            </parameters>
          </instance>
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x40020600"/>
            <signals>
              <signal pad="PB2" function="A" group="TWCK"/>
              <signal pad="PB3" function="A" group="TWD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="23"/>
              <param name="DMAC_ID_RX" value="9"/>
            </parameters>
          </instance>
          <instance name="TWI2">
            <register-group address-space="base" name="TWI2" name-in-module="TWI" offset="0x40024600"/>
            <signals>
              <signal pad="PA5" function="A" group="TWCK"/>
              <signal pad="PA6" function="A" group="TWD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="22"/>
              <param name="DMAC_ID_RX" value="8"/>
            </parameters>
          </instance>
          <instance name="TWI3">
            <register-group address-space="base" name="TWI3" name-in-module="TWI" offset="0x40018600"/>
            <signals>
              <signal pad="PA4" function="A" group="TWCK"/>
              <signal pad="PA3" function="A" group="TWD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="17"/>
              <param name="DMAC_ID_RX" value="0"/>
            </parameters>
          </instance>
