Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg55/atdf/ATSAMG55J19.atdf
          <instance name="TWI4">
            <register-group address-space="base" name="TWI4" name-in-module="TWI" offset="0x4001C600"/>
            <signals>
              <signal pad="PB9" function="A" group="TWCK"/>
              <signal pad="PB11" function="A" group="TWCK"/>
              <signal pad="PB8" function="A" group="TWD"/>
              <signal pad="PB10" function="A" group="TWD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="26"/>
              <param name="DMAC_ID_RX" value="12"/>
            </parameters>
          </instance>
          <instance name="TWI5">
            <register-group address-space="base" name="TWI5" name-in-module="TWI" offset="0x40008600"/>
            <signals>
              <signal pad="PA12" function="A" group="TWCK"/>
              <signal pad="PA13" function="A" group="TWD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="27"/>
              <param name="DMAC_ID_RX" value="13"/>
            </parameters>
          </instance>
          <instance name="TWI6">
            <register-group address-space="base" name="TWI6" name-in-module="TWI" offset="0x40040600"/>
            <signals>
              <signal pad="PB1" function="B" group="TWCK"/>
              <signal pad="PB11" function="B" group="TWCK"/>
              <signal pad="PB0" function="B" group="TWD"/>
              <signal pad="PB10" function="B" group="TWD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="25"/>
              <param name="DMAC_ID_RX" value="11"/>
            </parameters>
          </instance>
          <instance name="TWI7">
            <register-group address-space="base" name="TWI7" name-in-module="TWI" offset="0x40034600"/>
            <signals>
              <signal pad="PA27" function="B" group="TWCK"/>
              <signal pad="PA28" function="B" group="TWD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="29"/>
              <param name="DMAC_ID_RX" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="UDP" id="6083" version="Y">
          <instance name="UDP">
            <register-group address-space="base" name="UDP" name-in-module="UDP" offset="0x40044000"/>
            <parameters>
              <param name="INSTANCE_ID" value="48"/>
              <param name="CLOCK_ID" value="48"/>
            </parameters>
          </instance>
        </module>
        <module name="UHP" id="6127" version="G">
          <instance name="UHP">
            <register-group address-space="base" name="UHP" name-in-module="UHP" offset="0x20400000"/>
            <signals>
              <signal pad="PA21" function="X1" group="DM"/>
              <signal pad="PA22" function="X1" group="DP"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="47"/>
              <param name="CLOCK_ID" value="47"/>
            </parameters>
          </instance>
        </module>
        <module name="USART" id="11278" version="C">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x4000C200"/>
            <signals>
              <signal pad="PA9" function="A" group="RXD"/>
              <signal pad="PB0" function="A" group="SCK"/>
              <signal pad="PA25" function="A" group="CTS"/>
              <signal pad="PA26" function="A" group="RTS"/>
              <signal pad="PA10" function="A" group="TXD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="24"/>
              <param name="DMAC_ID_RX" value="10"/>
            </parameters>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x40020200"/>
            <signals>
              <signal pad="PB2" function="A" group="RXD"/>
              <signal pad="PA27" function="A" group="SCK"/>
              <signal pad="PA28" function="A" group="CTS"/>
              <signal pad="PA29" function="A" group="RTS"/>
              <signal pad="PB3" function="A" group="TXD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="23"/>
              <param name="DMAC_ID_RX" value="9"/>
            </parameters>
          </instance>
          <instance name="USART2">
            <register-group address-space="base" name="USART2" name-in-module="USART" offset="0x40024200"/>
            <signals>
              <signal pad="PA5" function="A" group="RXD"/>
              <signal pad="PA15" function="B" group="SCK"/>
              <signal pad="PA24" function="B" group="SCK"/>
              <signal pad="PA16" function="A" group="CTS"/>
              <signal pad="PA15" function="A" group="RTS"/>
              <signal pad="PA6" function="A" group="TXD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="22"/>
              <param name="DMAC_ID_RX" value="8"/>
            </parameters>
          </instance>
          <instance name="USART3">
            <register-group address-space="base" name="USART3" name-in-module="USART" offset="0x40018200"/>
            <signals>
              <signal pad="PA4" function="A" group="RXD"/>
              <signal pad="PB13" function="A" group="SCK"/>
              <signal pad="PB14" function="A" group="CTS"/>
              <signal pad="PB15" function="A" group="RTS"/>
              <signal pad="PA3" function="A" group="TXD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="17"/>
              <param name="DMAC_ID_RX" value="0"/>
            </parameters>
          </instance>
          <instance name="USART4">
            <register-group address-space="base" name="USART4" name-in-module="USART" offset="0x4001C200"/>
            <signals>
              <signal pad="PB9" function="A" group="RXD"/>
              <signal pad="PB11" function="A" group="RXD"/>
              <signal pad="PB1" function="A" group="SCK"/>
              <signal pad="PB8" function="B" group="CTS"/>
              <signal pad="PB9" function="B" group="RTS"/>
              <signal pad="PB8" function="A" group="TXD"/>
              <signal pad="PB10" function="A" group="TXD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="26"/>
              <param name="DMAC_ID_RX" value="12"/>
            </parameters>
          </instance>
          <instance name="USART5">
            <register-group address-space="base" name="USART5" name-in-module="USART" offset="0x40008200"/>
            <signals>
              <signal pad="PA12" function="A" group="RXD"/>
              <signal pad="PA14" function="A" group="SCK"/>
              <signal pad="PA11" function="A" group="CTS"/>
              <signal pad="PA5" function="B" group="RTS"/>
              <signal pad="PB2" function="B" group="RTS"/>
              <signal pad="PA13" function="A" group="TXD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="27"/>
              <param name="DMAC_ID_RX" value="13"/>
            </parameters>
          </instance>
          <instance name="USART6">
            <register-group address-space="base" name="USART6" name-in-module="USART" offset="0x40040200"/>
            <signals>
              <signal pad="PB1" function="B" group="RXD"/>
              <signal pad="PB11" function="B" group="RXD"/>
              <signal pad="PB13" function="B" group="SCK"/>
              <signal pad="PB14" function="B" group="CTS"/>
              <signal pad="PB15" function="B" group="RTS"/>
              <signal pad="PB0" function="B" group="TXD"/>
              <signal pad="PB10" function="B" group="TXD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="25"/>
              <param name="DMAC_ID_RX" value="11"/>
            </parameters>
          </instance>
          <instance name="USART7">
            <register-group address-space="base" name="USART7" name-in-module="USART" offset="0x40034200"/>
            <signals>
              <signal pad="PA27" function="B" group="RXD"/>
              <signal pad="PA29" function="B" group="SCK"/>
              <signal pad="PA30" function="B" group="CTS"/>
              <signal pad="PA31" function="B" group="RTS"/>
              <signal pad="PA28" function="B" group="TXD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="29"/>
              <param name="DMAC_ID_RX" value="16"/>
            </parameters>
          </instance>
        </module>
