Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg55/atdf/ATSAMG55J19.atdf
      <value-group caption="" name="CMCC_TYPE__WAYNUM">
        <value caption="Direct Mapped Cache" name="DMAPPED" value="0x0"/>
        <value caption="2-way set associative" name="ARCH2WAY" value="0x1"/>
        <value caption="4-way set associative" name="ARCH4WAY" value="0x2"/>
        <value caption="8-way set associative" name="ARCH8WAY" value="0x3"/>
      </value-group>
      <value-group caption="" name="CMCC_TYPE__CSIZE">
        <value caption="Data cache size is 1 Kbyte" name="CSIZE_1KB" value="0x0"/>
        <value caption="Data cache size is 2 Kbytes" name="CSIZE_2KB" value="0x1"/>
        <value caption="Data cache size is 4 Kbytes" name="CSIZE_4KB" value="0x2"/>
        <value caption="Data cache size is 8 Kbytes" name="CSIZE_8KB" value="0x3"/>
      </value-group>
      <value-group caption="" name="CMCC_TYPE__CLSIZE">
        <value caption="Cache line size is 4 bytes" name="CLSIZE_1KB" value="0x0"/>
        <value caption="Cache line size is 8 bytes" name="CLSIZE_2KB" value="0x1"/>
        <value caption="Cache line size is 16 bytes" name="CLSIZE_4KB" value="0x2"/>
        <value caption="Cache line size is 32 bytes" name="CLSIZE_8KB" value="0x3"/>
      </value-group>
      <value-group caption="" name="CMCC_MAINT1__WAY">
        <value caption="Way 0 is selection for index invalidation" name="WAY0" value="0x0"/>
        <value caption="Way 1 is selection for index invalidation" name="WAY1" value="0x1"/>
        <value caption="Way 2 is selection for index invalidation" name="WAY2" value="0x2"/>
        <value caption="Way 3 is selection for index invalidation" name="WAY3" value="0x3"/>
      </value-group>
      <value-group caption="" name="CMCC_MCFG__MODE">
        <value caption="Cycle counter" name="CYCLE_COUNT" value="0x0"/>
        <value caption="Instruction hit counter" name="IHIT_COUNT" value="0x1"/>
        <value caption="Data hit counter" name="DHIT_COUNT" value="0x2"/>
      </value-group>
    </module>
    <module name="CRCCU" caption="Cyclic Redundancy Check Calculation Unit" id="11001" version="I">
      <register-group name="CRCCU">
        <register caption="CRCCU Descriptor Base Register" name="CRCCU_DSCR" offset="0x000" rw="RW" size="4">
          <bitfield caption="Descriptor Base Address" mask="0xFFFFFE00" name="DSCR"/>
        </register>
        <register caption="CRCCU DMA Enable Register" name="CRCCU_DMA_EN" offset="0x008" rw="W" size="4">
          <bitfield caption="DMA Enable" mask="0x00000001" name="DMAEN"/>
        </register>
        <register caption="CRCCU DMA Disable Register" name="CRCCU_DMA_DIS" offset="0x00C" rw="W" size="4">
          <bitfield caption="DMA Disable" mask="0x00000001" name="DMADIS"/>
        </register>
        <register caption="CRCCU DMA Status Register" name="CRCCU_DMA_SR" offset="0x010" rw="R" size="4">
          <bitfield caption="DMA Status" mask="0x00000001" name="DMASR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Enable Register" name="CRCCU_DMA_IER" offset="0x014" rw="W" size="4" atomic-op="set:CRCCU_DMA_IMR">
          <bitfield caption="Interrupt Enable" mask="0x00000001" name="DMAIER"/>
        </register>
        <register caption="CRCCU DMA Interrupt Disable Register" name="CRCCU_DMA_IDR" offset="0x018" rw="W" size="4" atomic-op="clear:CRCCU_DMA_IMR">
          <bitfield caption="Interrupt Disable" mask="0x00000001" name="DMAIDR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Mask Register" name="CRCCU_DMA_IMR" offset="0x001C" rw="R" size="4" atomic-op="read:CRCCU_DMA_IMR">
          <bitfield caption="Interrupt Mask" mask="0x00000001" name="DMAIMR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Status Register" name="CRCCU_DMA_ISR" offset="0x020" rw="R" size="4" atomic-op="read:CRCCU_DMA_ISR">
          <bitfield caption="Interrupt Status" mask="0x00000001" name="DMAISR"/>
        </register>
        <register caption="CRCCU Control Register" name="CRCCU_CR" offset="0x034" rw="W" size="4">
          <bitfield caption="CRC Computation Reset" mask="0x00000001" name="RESET"/>
        </register>
        <register caption="CRCCU Mode Register" name="CRCCU_MR" offset="0x038" rw="RW" size="4">
          <bitfield caption="CRC Enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="CRC Compare" mask="0x00000002" name="COMPARE"/>
          <bitfield caption="Primitive Polynomial" mask="0x0000000C" name="PTYPE" values="CRCCU_MR__PTYPE"/>
          <bitfield caption="Request Divider" mask="0x000000F0" name="DIVIDER"/>
          <bitfield caption="Precomputation Bit Swap Operation of the CRC" mask="0x00020000" name="BITORDER" values="CRCCU_MR__BITORDER"/>
        </register>
        <register caption="CRCCU Status Register" name="CRCCU_SR" offset="0x03C" rw="R" size="4">
          <bitfield caption="Cyclic Redundancy Check Value" mask="0xFFFFFFFF" name="CRC"/>
        </register>
        <register caption="CRCCU Interrupt Enable Register" name="CRCCU_IER" offset="0x040" rw="W" size="4" atomic-op="set:CRCCU_IMR">
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000001" name="ERRIER"/>
        </register>
        <register caption="CRCCU Interrupt Disable Register" name="CRCCU_IDR" offset="0x044" rw="W" size="4" atomic-op="clear:CRCCU_IMR">
          <bitfield caption="CRC Error Interrupt Disable" mask="0x00000001" name="ERRIDR"/>
        </register>
        <register caption="CRCCU Interrupt Mask Register" name="CRCCU_IMR" offset="0x048" rw="R" size="4" atomic-op="read:CRCCU_IMR">
          <bitfield caption="CRC Error Interrupt Mask" mask="0x00000001" name="ERRIMR"/>
        </register>
        <register caption="CRCCU Interrupt Status Register" name="CRCCU_ISR" offset="0x004C" rw="R" size="4" atomic-op="read:CRCCU_ISR">
          <bitfield caption="CRC Error Interrupt Status" mask="0x00000001" name="ERRISR"/>
        </register>
      </register-group>
      <value-group caption="" name="CRCCU_MR__PTYPE">
        <value caption="Polynom 0x04C11DB7" name="CCITT8023" value="0x0"/>
        <value caption="Polynom 0x1EDC6F41" name="CASTAGNOLI" value="0x1"/>
        <value caption="Polynom 0x1021" name="CCITT16" value="0x2"/>
      </value-group>
      <value-group caption="" name="CRCCU_MR__BITORDER">
        <value caption="CRC computation is performed from the most significant bit to the least significant bit" name="MSBFIRST" value="0"/>
        <value caption="CRC computation is performed from the least significant bit to the most significant bit" name="LSBFIRST" value="1"/>
      </value-group>
    </module>
    <module name="EFC" caption="Embedded Flash Controller" id="6450" version="U">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Flash Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Flash Access Mode" mask="0x01000000" name="FAM"/>
          <bitfield caption="Code Loop Optimization Enable" mask="0x04000000" name="CLOE"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status (cleared when Flash is busy)" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status (cleared on read or by writing EEFC_FCR)" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status (cleared on read)" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status (cleared when a programming operation starts)" mask="0x00000008" name="FLERR"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
