Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg55/atdf/ATSAMG55J19.atdf
        <register caption="Write Protection Mode Register" name="EEFC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="EEFC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="EEFC_FCR__FCMD">
        <value caption="Get Flash descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase page and write page" name="EWP" value="0x03"/>
        <value caption="Erase page and write page then lock" name="EWPL" value="0x04"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Erase pages" name="EPA" value="0x07"/>
        <value caption="Set lock bit" name="SLB" value="0x08"/>
        <value caption="Clear lock bit" name="CLB" value="0x09"/>
        <value caption="Get lock bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM bit" name="GGPB" value="0x0D"/>
        <value caption="Start read unique identifier" name="STUI" value="0x0E"/>
        <value caption="Stop read unique identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB bit" name="GCALB" value="0x10"/>
        <value caption="Erase sector" name="ES" value="0x11"/>
        <value caption="Write user signature" name="WUS" value="0x12"/>
        <value caption="Erase user signature" name="EUS" value="0x13"/>
        <value caption="Start read user signature" name="STUS" value="0x14"/>
        <value caption="Stop read user signature" name="SPUS" value="0x15"/>
      </value-group>
      <value-group caption="" name="EEFC_FCR__FKEY">
        <value caption="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." name="PASSWD" value="0x5A"/>
      </value-group>
      <value-group caption="" name="EEFC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x454643"/>
      </value-group>
    </module>
    <module name="FLEXCOM" caption="Flexible Serial Communication" id="11277" version="A">
      <register-group name="FLEXCOM">
        <register caption="FLEXCOM Mode register" name="FLEXCOM_MR" offset="0x0000" rw="RW" size="4">
          <bitfield caption="FLEXCOM Operating Mode" mask="0x00000003" name="OPMODE" values="FLEXCOM_MR__OPMODE"/>
        </register>
        <register caption="FLEXCOM Receive Holding Register" name="FLEXCOM_RHR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RXDATA"/>
        </register>
        <register caption="FLEXCOM Transmit Holding Register" name="FLEXCOM_THR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TXDATA"/>
        </register>
      </register-group>
      <value-group caption="" name="FLEXCOM_MR__OPMODE">
        <value caption="No communication" name="NO_COM" value="0x0"/>
        <value caption="All related USART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN,)All SPI/TWI related registers are not accessible and have no impact on IOs." name="USART" value="0x1"/>
        <value caption="SPI operating mode is selected.All USART/TWI related registers are not accessible and have no impact on IOs." name="SPI" value="0x2"/>
        <value caption="All related TWI protocols are selected (TWI, SMBUS). All USART/SPI related registers are not accessible and have no impact on IOs." name="TWI" value="0x3"/>
      </value-group>
    </module>
    <module name="GPBR" caption="General Purpose Backup Registers" id="6378" version="G">
      <register-group name="GPBR">
        <register caption="General Purpose Backup Register 0" name="SYS_GPBR" offset="0x0" rw="RW" size="4" count="8">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
      </register-group>
    </module>
    <module name="I2SC" caption="Inter-IC Sound Controller" id="11241" version="F">
      <register-group name="I2SC">
        <register caption="Control Register" name="I2SC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Receiver Enable" mask="0x00000001" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000002" name="RXDIS"/>
          <bitfield caption="Clocks Enable" mask="0x00000004" name="CKEN"/>
          <bitfield caption="Clocks Disable" mask="0x00000008" name="CKDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000010" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000020" name="TXDIS"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="I2SC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Inter-IC Sound Controller Mode" mask="0x00000001" name="MODE" values="I2SC_MR__MODE"/>
          <bitfield caption="Data Word Length" mask="0x0000001C" name="DATALENGTH" values="I2SC_MR__DATALENGTH"/>
          <bitfield caption="Receive Mono" mask="0x00000100" name="RXMONO"/>
          <bitfield caption="Single or Multiple PDC Channels for Receiver" mask="0x00000200" name="RXDMA"/>
          <bitfield caption="Loop-back Test Mode" mask="0x00000400" name="RXLOOP"/>
          <bitfield caption="Transmit Mono" mask="0x00001000" name="TXMONO"/>
          <bitfield caption="Single or Multiple PDC Channels for Transmitter" mask="0x00002000" name="TXDMA"/>
          <bitfield caption="Transmit Data when Underrun" mask="0x00004000" name="TXSAME"/>
          <bitfield caption="Selected Clock to I2SC Master Clock Ratio" mask="0x003F0000" name="IMCKDIV"/>
          <bitfield caption="Master Clock to fs Ratio" mask="0x3F000000" name="IMCKFS" values="I2SC_MR__IMCKFS"/>
          <bitfield caption="Master Clock Mode" mask="0x40000000" name="IMCKMODE"/>
          <bitfield caption="I2SWS TDM Slot Width" mask="0x80000000" name="IWS"/>
        </register>
