Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg55/atdf/ATSAMG55J19.atdf
        <register caption="Status Register" name="I2SC_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="Receiver Enabled" mask="0x00000001" name="RXEN"/>
          <bitfield caption="Receive Ready" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receive Overrun" mask="0x00000004" name="RXOR"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Transmitter Enabled" mask="0x00000010" name="TXEN"/>
          <bitfield caption="Transmit Ready" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underrun" mask="0x00000040" name="TXUR"/>
          <bitfield caption="End of Transmitter Transfer" mask="0x00000080" name="ENDTX"/>
          <bitfield caption="Receive Overrun Channel" mask="0x00000300" name="RXORCH"/>
          <bitfield caption="Receive Buffer Full" mask="0x00080000" name="RXBUFF"/>
          <bitfield caption="Transmit Underrun Channel" mask="0x00300000" name="TXURCH"/>
          <bitfield caption="Transmit Buffer Empty" mask="0x80000000" name="TXBUFE"/>
        </register>
        <register caption="Status Clear Register" name="I2SC_SCR" offset="0x0C" rw="W" size="4">
          <bitfield caption="Receive Overrun Status Clear" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Underrun Status Clear" mask="0x00000040" name="TXUR"/>
          <bitfield caption="Receive Overrun Per Channel Status Clear" mask="0x00000300" name="RXORCH"/>
          <bitfield caption="Transmit Underrun Per Channel Status Clear" mask="0x00300000" name="TXURCH"/>
        </register>
        <register caption="Status Set Register" name="I2SC_SSR" offset="0x10" rw="W" size="4">
          <bitfield caption="Receive Overrun Status Set" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Underrun Status Set" mask="0x00000040" name="TXUR"/>
          <bitfield caption="Receive Overrun Per Channel Status Set" mask="0x00000300" name="RXORCH"/>
          <bitfield caption="Transmit Underrun Per Channel Status Set" mask="0x00300000" name="TXURCH"/>
        </register>
        <register caption="Interrupt Enable Register" name="I2SC_IER" offset="0x14" rw="W" size="4" atomic-op="set:I2SC_IMR">
          <bitfield caption="Receiver Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receiver Overrun Interrupt Enable" mask="0x00000004" name="RXOR"/>
          <bitfield caption="End of Reception Interrupt Enable" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Transmit Ready Interrupt Enable" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underflow Interrupt Enable" mask="0x00000040" name="TXUR"/>
          <bitfield caption="End of Transmission Interrupt Enable" mask="0x00000080" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00080000" name="RXFULL"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x80000000" name="TXEMPTY"/>
        </register>
        <register caption="Interrupt Disable Register" name="I2SC_IDR" offset="0x18" rw="W" size="4" atomic-op="clear:I2SC_IMR">
          <bitfield caption="Receiver Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receiver Overrun Interrupt Disable" mask="0x00000004" name="RXOR"/>
          <bitfield caption="End of Reception Interrupt Disable" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underflow Interrupt Disable" mask="0x00000040" name="TXUR"/>
          <bitfield caption="End of Transmission Interrupt Disable" mask="0x00000080" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00080000" name="RXFULL"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x80000000" name="TXEMPTY"/>
        </register>
        <register caption="Interrupt Mask Register" name="I2SC_IMR" offset="0x1C" rw="R" size="4" atomic-op="read:I2SC_IMR">
          <bitfield caption="Receiver Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receiver Overrun Interrupt Disable" mask="0x00000004" name="RXOR"/>
          <bitfield caption="End of Reception Interrupt Disable" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underflow Interrupt Disable" mask="0x00000040" name="TXUR"/>
          <bitfield caption="End of Transmission Interrupt Disable" mask="0x00000080" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00080000" name="RXFULL"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x80000000" name="TXEMPTY"/>
        </register>
        <register caption="Receiver Holding Register" name="I2SC_RHR" offset="0x20" rw="R" size="4">
          <bitfield caption="Receiver Holding Register" mask="0xFFFFFFFF" name="RHR"/>
        </register>
        <register caption="Transmitter Holding Register" name="I2SC_THR" offset="0x24" rw="W" size="4">
          <bitfield caption="Transmitter Holding Register" mask="0xFFFFFFFF" name="THR"/>
        </register>
        <register caption="Receive Pointer Register - Left side" name="I2SC_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register - Left side" name="I2SC_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register - Left side" name="I2SC_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
