Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg55/atdf/ATSAMG55J19.atdf
        <register caption="Status Register" name="RSTC_SR" offset="0x04" rw="R" size="4">
          <bitfield caption="User Reset Status" mask="0x00000001" name="URSTS"/>
          <bitfield caption="Reset Type" mask="0x00000700" name="RSTTYP" values="RSTC_SR__RSTTYP"/>
          <bitfield caption="NRST Pin Level" mask="0x00010000" name="NRSTL"/>
          <bitfield caption="Software Reset Command in Progress" mask="0x00020000" name="SRCMP"/>
        </register>
        <register caption="Mode Register" name="RSTC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Reset Enable" mask="0x00000001" name="URSTEN"/>
          <bitfield caption="Slow Clock Switching" mask="0x00000002" name="SCKSW"/>
          <bitfield caption="User Reset Interrupt Enable" mask="0x00000010" name="URSTIEN"/>
          <bitfield caption="External Reset Length" mask="0x00000F00" name="ERSTL"/>
          <bitfield caption="Write Access Password" mask="0xFF000000" name="KEY" values="RSTC_MR__KEY"/>
        </register>
      </register-group>
      <value-group caption="" name="RSTC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="RSTC_SR__RSTTYP">
        <value caption="First power-up reset" name="GENERAL_RST" value="0x0"/>
        <value caption="Return from Backup Mode" name="BACKUP_RST" value="0x1"/>
        <value caption="Watchdog fault occurred" name="WDT_RST" value="0x2"/>
        <value caption="Processor reset required by the software" name="SOFT_RST" value="0x3"/>
        <value caption="NRST pin detected low" name="USER_RST" value="0x4"/>
        <value caption="Slow Crystal Failure Detection fault occured" name="SLCK_XTAL_RST" value="0x7"/>
      </value-group>
      <value-group caption="" name="RSTC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
    </module>
    <module name="RTC" caption="Real-time Clock" id="6056" version="T">
      <register-group name="RTC">
        <register caption="Control Register" name="RTC_CR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Update Request Time Register" mask="0x00000001" name="UPDTIM"/>
          <bitfield caption="Update Request Calendar Register" mask="0x00000002" name="UPDCAL"/>
          <bitfield caption="Time Event Selection" mask="0x00000300" name="TIMEVSEL" values="RTC_CR__TIMEVSEL"/>
          <bitfield caption="Calendar Event Selection" mask="0x00030000" name="CALEVSEL" values="RTC_CR__CALEVSEL"/>
        </register>
        <register caption="Mode Register" name="RTC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="12-/24-hour Mode" mask="0x00000001" name="HRMOD"/>
          <bitfield caption="PERSIAN Calendar" mask="0x00000002" name="PERSIAN"/>
          <bitfield caption="NEGative PPM Correction" mask="0x00000010" name="NEGPPM"/>
          <bitfield caption="Slow Clock Correction" mask="0x00007F00" name="CORRECTION"/>
          <bitfield caption="HIGH PPM Correction" mask="0x00008000" name="HIGHPPM"/>
          <bitfield caption="RTCOUT0 OutputSource Selection" mask="0x00070000" name="OUT0" values="RTC_MR__OUT0"/>
          <bitfield caption="RTCOUT1 Output Source Selection" mask="0x00700000" name="OUT1" values="RTC_MR__OUT1"/>
          <bitfield caption="High Duration of the Output Pulse" mask="0x07000000" name="THIGH" values="RTC_MR__THIGH"/>
          <bitfield caption="Period of the Output Pulse" mask="0x30000000" name="TPERIOD" values="RTC_MR__TPERIOD"/>
        </register>
        <register caption="Time Register" name="RTC_TIMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Current Second" mask="0x0000007F" name="SEC"/>
          <bitfield caption="Current Minute" mask="0x00007F00" name="MIN"/>
          <bitfield caption="Current Hour" mask="0x003F0000" name="HOUR"/>
          <bitfield caption="Ante Meridiem Post Meridiem Indicator" mask="0x00400000" name="AMPM"/>
        </register>
        <register caption="Calendar Register" name="RTC_CALR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Current Century" mask="0x0000007F" name="CENT"/>
          <bitfield caption="Current Year" mask="0x0000FF00" name="YEAR"/>
          <bitfield caption="Current Month" mask="0x001F0000" name="MONTH"/>
          <bitfield caption="Current Day in Current Week" mask="0x00E00000" name="DAY"/>
          <bitfield caption="Current Day in Current Month" mask="0x3F000000" name="DATE"/>
        </register>
        <register caption="Time Alarm Register" name="RTC_TIMALR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Second Alarm" mask="0x0000007F" name="SEC"/>
          <bitfield caption="Second Alarm Enable" mask="0x00000080" name="SECEN"/>
          <bitfield caption="Minute Alarm" mask="0x00007F00" name="MIN"/>
          <bitfield caption="Minute Alarm Enable" mask="0x00008000" name="MINEN"/>
          <bitfield caption="Hour Alarm" mask="0x003F0000" name="HOUR"/>
          <bitfield caption="AM/PM Indicator" mask="0x00400000" name="AMPM"/>
          <bitfield caption="Hour Alarm Enable" mask="0x00800000" name="HOUREN"/>
        </register>
        <register caption="Calendar Alarm Register" name="RTC_CALALR" offset="0x14" rw="RW" size="4">
          <bitfield caption="Month Alarm" mask="0x001F0000" name="MONTH"/>
          <bitfield caption="Month Alarm Enable" mask="0x00800000" name="MTHEN"/>
          <bitfield caption="Date Alarm" mask="0x3F000000" name="DATE"/>
          <bitfield caption="Date Alarm Enable" mask="0x80000000" name="DATEEN"/>
        </register>
        <register caption="Status Register" name="RTC_SR" offset="0x18" rw="R" size="4">
          <bitfield caption="Acknowledge for Update" mask="0x00000001" name="ACKUPD" values="RTC_SR__ACKUPD"/>
          <bitfield caption="Alarm Flag" mask="0x00000002" name="ALARM" values="RTC_SR__ALARM"/>
          <bitfield caption="Second Event" mask="0x00000004" name="SEC" values="RTC_SR__SEC"/>
          <bitfield caption="Time Event" mask="0x00000008" name="TIMEV" values="RTC_SR__TIMEV"/>
          <bitfield caption="Calendar Event" mask="0x00000010" name="CALEV" values="RTC_SR__CALEV"/>
          <bitfield caption="Time and/or Date Free Running Error" mask="0x00000020" name="TDERR" values="RTC_SR__TDERR"/>
        </register>
        <register caption="Status Clear Command Register" name="RTC_SCCR" offset="0x1C" rw="W" size="4">
          <bitfield caption="Acknowledge Clear" mask="0x00000001" name="ACKCLR"/>
          <bitfield caption="Alarm Clear" mask="0x00000002" name="ALRCLR"/>
          <bitfield caption="Second Clear" mask="0x00000004" name="SECCLR"/>
          <bitfield caption="Time Clear" mask="0x00000008" name="TIMCLR"/>
          <bitfield caption="Calendar Clear" mask="0x00000010" name="CALCLR"/>
          <bitfield caption="Time and/or Date Free Running Error Clear" mask="0x00000020" name="TDERRCLR"/>
        </register>
