Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg55/atdf/ATSAMG55J19.atdf
      <value-group caption="" name="TC_BMR__TC0XC0S">
        <value caption="Signal connected to XC0: TCLK0" name="TCLK0" value="0x0"/>
        <value caption="Signal connected to XC0: TIOA1" name="TIOA1" value="0x2"/>
        <value caption="Signal connected to XC0: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_BMR__TC1XC1S">
        <value caption="Signal connected to XC1: TCLK1" name="TCLK1" value="0x0"/>
        <value caption="Signal connected to XC1: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC1: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_BMR__TC2XC2S">
        <value caption="Signal connected to XC2: TCLK2" name="TCLK2" value="0x0"/>
        <value caption="Signal connected to XC2: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC2: TIOA1" name="TIOA1" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x54494D"/>
      </value-group>
    </module>
    <module name="TWI" caption="Two-wire Interface" id="11280" version="C">
      <register-group name="TWI">
        <register caption="Control Register" name="TWI_CR" offset="0x000" rw="W" size="4">
          <bitfield caption="Send a START Condition" mask="0x00000001" name="START"/>
          <bitfield caption="Send a STOP Condition" mask="0x00000002" name="STOP"/>
          <bitfield caption="TWI Master Mode Enabled" mask="0x00000004" name="MSEN"/>
          <bitfield caption="TWI Master Mode Disabled" mask="0x00000008" name="MSDIS"/>
          <bitfield caption="TWI Slave Mode Enabled" mask="0x00000010" name="SVEN"/>
          <bitfield caption="TWI Slave Mode Disabled" mask="0x00000020" name="SVDIS"/>
          <bitfield caption="SMBus Quick Command" mask="0x00000040" name="QUICK"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
          <bitfield caption="TWI High-Speed Mode Enabled" mask="0x00000100" name="HSEN"/>
          <bitfield caption="TWI High-Speed Mode Disabled" mask="0x00000200" name="HSDIS"/>
          <bitfield caption="SMBus Mode Enabled" mask="0x00000400" name="SMBEN"/>
          <bitfield caption="SMBus Mode Disabled" mask="0x00000800" name="SMBDIS"/>
          <bitfield caption="Packet Error Checking Enable" mask="0x00001000" name="PECEN"/>
          <bitfield caption="Packet Error Checking Disable" mask="0x00002000" name="PECDIS"/>
          <bitfield caption="PEC Request" mask="0x00004000" name="PECRQ"/>
          <bitfield caption="Bus CLEAR Command" mask="0x00008000" name="CLEAR"/>
          <bitfield caption="Alternative Command Mode Enable" mask="0x00010000" name="ACMEN"/>
          <bitfield caption="Alternative Command Mode Disable" mask="0x00020000" name="ACMDIS"/>
          <bitfield caption="Transmit Holding Register Clear" mask="0x01000000" name="THRCLR"/>
          <bitfield caption="Lock Clear" mask="0x04000000" name="LOCKCLR"/>
        </register>
        <register caption="Master Mode Register" name="TWI_MMR" offset="0x004" rw="RW" size="4">
          <bitfield caption="Internal Device Address Size" mask="0x00000300" name="IADRSZ" values="TWI_MMR__IADRSZ"/>
          <bitfield caption="Master Read Direction" mask="0x00001000" name="MREAD"/>
          <bitfield caption="Device Address" mask="0x007F0000" name="DADR"/>
        </register>
        <register caption="Slave Mode Register" name="TWI_SMR" offset="0x008" rw="RW" size="4">
          <bitfield caption="Slave Receiver Data Phase NACK Enable" mask="0x00000001" name="NACKEN"/>
          <bitfield caption="SMBus Default Address" mask="0x00000004" name="SMDA"/>
          <bitfield caption="SMBus Host Header" mask="0x00000008" name="SMHH"/>
          <bitfield caption="Clock Wait State Disable" mask="0x00000040" name="SCLWSDIS"/>
          <bitfield caption="Slave Address Mask" mask="0x00007F00" name="MASK"/>
          <bitfield caption="Slave Address" mask="0x007F0000" name="SADR"/>
          <bitfield caption="Slave Address 1 Enable" mask="0x10000000" name="SADR1EN"/>
          <bitfield caption="Slave Address 2 Enable" mask="0x20000000" name="SADR2EN"/>
          <bitfield caption="Slave Address 3 Enable" mask="0x40000000" name="SADR3EN"/>
          <bitfield caption="Data Matching Enable" mask="0x80000000" name="DATAMEN"/>
        </register>
        <register caption="Internal Address Register" name="TWI_IADR" offset="0x00C" rw="RW" size="4">
          <bitfield caption="Internal Address" mask="0x00FFFFFF" name="IADR"/>
        </register>
        <register caption="Clock Waveform Generator Register" name="TWI_CWGR" offset="0x010" rw="RW" size="4">
          <bitfield caption="Clock Low Divider" mask="0x000000FF" name="CLDIV"/>
          <bitfield caption="Clock High Divider" mask="0x0000FF00" name="CHDIV"/>
          <bitfield caption="Clock Divider" mask="0x00070000" name="CKDIV"/>
          <bitfield caption="Bit Rate Source Clock" mask="0x00100000" name="BRSRCCLK" values="TWI_CWGR__BRSRCCLK"/>
          <bitfield caption="TWD Hold Time Versus TWCK Falling" mask="0x1F000000" name="HOLD"/>
        </register>
        <register caption="Status Register" name="TWI_SR" offset="0x020" rw="R" size="4">
          <bitfield caption="Transmission Completed (cleared by writing TWI_THR)" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready (cleared when reading TWI_RHR)" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready (cleared by writing TWI_THR)" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Read" mask="0x00000008" name="SVREAD"/>
          <bitfield caption="Slave Access" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access (cleared on read)" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error (cleared on read)" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error (cleared on read)" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledged (cleared on read)" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost (cleared on read)" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State" mask="0x00000400" name="SCLWS"/>
          <bitfield caption="End Of Slave Access (cleared on read)" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of RX buffer (cleared by writing TWI_RCR or TWI_RNCR)" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of TX buffer (cleared by writing TWI_TCR or TWI_TNCR)" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="RX Buffer Full (cleared by writing TWI_RCR or TWI_RNCR)" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="TX Buffer Empty (cleared by writing TWI_TCR or TWI_TNCR)" mask="0x00008000" name="TXBUFE"/>
          <bitfield caption="Master Code Acknowledge (cleared on read)" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error (cleared on read)" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error (cleared on read)" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match (cleared on read)" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match (cleared on read)" mask="0x00200000" name="SMBHHM"/>
          <bitfield caption="TWI Lock due to Frame Errors" mask="0x00800000" name="LOCK"/>
          <bitfield caption="SCL line value" mask="0x01000000" name="SCL"/>
          <bitfield caption="SDA line value" mask="0x02000000" name="SDA"/>
        </register>
        <register caption="Interrupt Enable Register" name="TWI_IER" offset="0x024" rw="W" size="4" atomic-op="set:TWI_IMR">
          <bitfield caption="Transmission Completed Interrupt Enable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Enable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Enable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Enable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Enable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Enable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Enable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Enable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00008000" name="TXBUFE"/>
          <bitfield caption="Master Code Acknowledge Interrupt Enable" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Enable" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Enable" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Enable" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Enable" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="Interrupt Disable Register" name="TWI_IDR" offset="0x028" rw="W" size="4" atomic-op="clear:TWI_IMR">
          <bitfield caption="Transmission Completed Interrupt Disable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Disable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Disable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Disable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Disable" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Disable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Disable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Disable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Disable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00008000" name="TXBUFE"/>
          <bitfield caption="Master Code Acknowledge Interrupt Disable" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Disable" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Disable" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Disable" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Disable" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="Interrupt Mask Register" name="TWI_IMR" offset="0x02C" rw="R" size="4" atomic-op="read:TWI_IMR">
          <bitfield caption="Transmission Completed Interrupt Mask" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Mask" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Mask" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Mask" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Mask" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Mask" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Mask" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Mask" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Mask" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Mask" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00008000" name="TXBUFE"/>
          <bitfield caption="Master Code Acknowledge Interrupt Mask" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Mask" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Mask" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Mask" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Mask" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="Receive Holding Register" name="TWI_RHR" offset="0x030" rw="R" size="4">
          <bitfield caption="Master or Slave Receive Holding Data" mask="0x000000FF" name="RXDATA"/>
        </register>
        <register caption="Transmit Holding Register" name="TWI_THR" offset="0x034" rw="W" size="4">
          <bitfield caption="Master or Slave Transmit Holding Data" mask="0x000000FF" name="TXDATA"/>
        </register>
        <register caption="SMBus Timing Register" name="TWI_SMBTR" offset="0x038" rw="RW" size="4">
          <bitfield caption="SMBus Clock Prescaler" mask="0x0000000F" name="PRESC"/>
          <bitfield caption="Slave Clock Stretch Maximum Cycles" mask="0x0000FF00" name="TLOWS"/>
          <bitfield caption="Master Clock Stretch Maximum Cycles" mask="0x00FF0000" name="TLOWM"/>
          <bitfield caption="Clock High Maximum Cycles" mask="0xFF000000" name="THMAX"/>
        </register>
        <register caption="Alternative Command Register" name="TWI_ACR" offset="0x040" rw="RW" size="4">
          <bitfield caption="Data Length" mask="0x000000FF" name="DATAL"/>
          <bitfield caption="Transfer Direction" mask="0x00000100" name="DIR"/>
          <bitfield caption="PEC Request (SMBus Mode only)" mask="0x00000200" name="PEC"/>
          <bitfield caption="Next Data Length" mask="0x00FF0000" name="NDATAL"/>
          <bitfield caption="Next Transfer Direction" mask="0x01000000" name="NDIR"/>
          <bitfield caption="Next PEC Request (SMBus Mode only)" mask="0x02000000" name="NPEC"/>
        </register>
        <register caption="Filter Register" name="TWI_FILTR" offset="0x044" rw="RW" size="4">
          <bitfield caption="RX Digital Filter" mask="0x00000001" name="FILT"/>
          <bitfield caption="PAD Filter Enable" mask="0x00000002" name="PADFEN"/>
          <bitfield caption="PAD Filter Config" mask="0x00000004" name="PADFCFG"/>
          <bitfield caption="Digital Filter Threshold" mask="0x00000700" name="THRES"/>
        </register>
