Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg55/atdf/ATSAMG55J19.atdf
        <register caption="Interrupt Enable Register" name="UDP_IER" offset="0x010" rw="W" size="4" atomic-op="set:UDP_IMR">
          <bitfield caption="Enable Endpoint 0 Interrupt" mask="0x00000001" name="EP0INT"/>
          <bitfield caption="Enable Endpoint 1 Interrupt" mask="0x00000002" name="EP1INT"/>
          <bitfield caption="Enable Endpoint 2Interrupt" mask="0x00000004" name="EP2INT"/>
          <bitfield caption="Enable Endpoint 3 Interrupt" mask="0x00000008" name="EP3INT"/>
          <bitfield caption="Enable Endpoint 4 Interrupt" mask="0x00000010" name="EP4INT"/>
          <bitfield caption="Enable Endpoint 5 Interrupt" mask="0x00000020" name="EP5INT"/>
          <bitfield caption="Enable UDP Suspend Interrupt" mask="0x00000100" name="RXSUSP"/>
          <bitfield caption="Enable UDP Resume Interrupt" mask="0x00000200" name="RXRSM"/>
          <bitfield mask="0x00000400" name="EXTRSM"/>
          <bitfield caption="Enable Start Of Frame Interrupt" mask="0x00000800" name="SOFINT"/>
          <bitfield caption="Enable UDP Bus Wakeup Interrupt" mask="0x00002000" name="WAKEUP"/>
        </register>
        <register caption="Interrupt Disable Register" name="UDP_IDR" offset="0x014" rw="W" size="4" atomic-op="clear:UDP_IMR">
          <bitfield caption="Disable Endpoint 0 Interrupt" mask="0x00000001" name="EP0INT"/>
          <bitfield caption="Disable Endpoint 1 Interrupt" mask="0x00000002" name="EP1INT"/>
          <bitfield caption="Disable Endpoint 2 Interrupt" mask="0x00000004" name="EP2INT"/>
          <bitfield caption="Disable Endpoint 3 Interrupt" mask="0x00000008" name="EP3INT"/>
          <bitfield caption="Disable Endpoint 4 Interrupt" mask="0x00000010" name="EP4INT"/>
          <bitfield caption="Disable Endpoint 5 Interrupt" mask="0x00000020" name="EP5INT"/>
          <bitfield caption="Disable UDP Suspend Interrupt" mask="0x00000100" name="RXSUSP"/>
          <bitfield caption="Disable UDP Resume Interrupt" mask="0x00000200" name="RXRSM"/>
          <bitfield mask="0x00000400" name="EXTRSM"/>
          <bitfield caption="Disable Start Of Frame Interrupt" mask="0x00000800" name="SOFINT"/>
          <bitfield caption="Disable USB Bus Interrupt" mask="0x00002000" name="WAKEUP"/>
        </register>
        <register caption="Interrupt Mask Register" name="UDP_IMR" offset="0x018" rw="R" size="4" atomic-op="read:UDP_IMR">
          <bitfield caption="Mask Endpoint 0 Interrupt" mask="0x00000001" name="EP0INT"/>
          <bitfield caption="Mask Endpoint 1 Interrupt" mask="0x00000002" name="EP1INT"/>
          <bitfield caption="Mask Endpoint 2 Interrupt" mask="0x00000004" name="EP2INT"/>
          <bitfield caption="Mask Endpoint 3 Interrupt" mask="0x00000008" name="EP3INT"/>
          <bitfield caption="Mask Endpoint 4 Interrupt" mask="0x00000010" name="EP4INT"/>
          <bitfield caption="Mask Endpoint 5 Interrupt" mask="0x00000020" name="EP5INT"/>
          <bitfield caption="Mask UDP Suspend Interrupt" mask="0x00000100" name="RXSUSP"/>
          <bitfield caption="Mask UDP Resume Interrupt." mask="0x00000200" name="RXRSM"/>
          <bitfield mask="0x00000400" name="EXTRSM"/>
          <bitfield caption="Mask Start Of Frame Interrupt" mask="0x00000800" name="SOFINT"/>
          <bitfield caption="UDP_IMR Bit 12" mask="0x00001000" name="BIT12"/>
          <bitfield caption="USB Bus Wakeup Interrupt" mask="0x00002000" name="WAKEUP"/>
        </register>
        <register caption="Interrupt Status Register" name="UDP_ISR" offset="0x01C" rw="R" size="4" atomic-op="read:UDP_ISR">
          <bitfield caption="Endpoint 0 Interrupt Status" mask="0x00000001" name="EP0INT"/>
          <bitfield caption="Endpoint 1 Interrupt Status" mask="0x00000002" name="EP1INT"/>
          <bitfield caption="Endpoint 2 Interrupt Status" mask="0x00000004" name="EP2INT"/>
          <bitfield caption="Endpoint 3 Interrupt Status" mask="0x00000008" name="EP3INT"/>
          <bitfield caption="Endpoint 4 Interrupt Status" mask="0x00000010" name="EP4INT"/>
          <bitfield caption="Endpoint 5 Interrupt Status" mask="0x00000020" name="EP5INT"/>
          <bitfield caption="UDP Suspend Interrupt Status" mask="0x00000100" name="RXSUSP"/>
          <bitfield caption="UDP Resume Interrupt Status" mask="0x00000200" name="RXRSM"/>
          <bitfield mask="0x00000400" name="EXTRSM"/>
          <bitfield caption="Start of Frame Interrupt Status" mask="0x00000800" name="SOFINT"/>
          <bitfield caption="End of BUS Reset Interrupt Status" mask="0x00001000" name="ENDBUSRES"/>
          <bitfield caption="UDP Resume Interrupt Status" mask="0x00002000" name="WAKEUP"/>
        </register>
        <register caption="Interrupt Clear Register" name="UDP_ICR" offset="0x020" rw="W" size="4" atomic-op="clear:UDP_ISR">
          <bitfield caption="Clear UDP Suspend Interrupt" mask="0x00000100" name="RXSUSP"/>
          <bitfield caption="Clear UDP Resume Interrupt" mask="0x00000200" name="RXRSM"/>
          <bitfield mask="0x00000400" name="EXTRSM"/>
          <bitfield caption="Clear Start Of Frame Interrupt" mask="0x00000800" name="SOFINT"/>
          <bitfield caption="Clear End of Bus Reset Interrupt" mask="0x00001000" name="ENDBUSRES"/>
          <bitfield caption="Clear Wakeup Interrupt" mask="0x00002000" name="WAKEUP"/>
        </register>
        <register caption="Reset Endpoint Register" name="UDP_RST_EP" offset="0x028" rw="RW" size="4">
          <bitfield caption="Reset Endpoint 0" mask="0x00000001" name="EP0"/>
          <bitfield caption="Reset Endpoint 1" mask="0x00000002" name="EP1"/>
          <bitfield caption="Reset Endpoint 2" mask="0x00000004" name="EP2"/>
          <bitfield caption="Reset Endpoint 3" mask="0x00000008" name="EP3"/>
          <bitfield caption="Reset Endpoint 4" mask="0x00000010" name="EP4"/>
          <bitfield caption="Reset Endpoint 5" mask="0x00000020" name="EP5"/>
        </register>
        <register caption="Endpoint Control and Status Register 0" name="UDP_CSR" offset="0x30" rw="RW" size="4" count="6">
          <bitfield caption="Generates an IN Packet with Data Previously Written in the DPR" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Data Bank 0" mask="0x00000002" name="RX_DATA_BK0"/>
          <bitfield caption="Received Setup" mask="0x00000004" name="RXSETUP"/>
          <bitfield caption="Stall Sent" mask="0x00000008" name="STALLSENT"/>
          <bitfield caption="Transmit Packet Ready" mask="0x00000010" name="TXPKTRDY"/>
          <bitfield caption="Force Stall (used by Control, Bulk and Isochronous Endpoints)" mask="0x00000020" name="FORCESTALL"/>
          <bitfield caption="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" mask="0x00000040" name="RX_DATA_BK1"/>
          <bitfield caption="Transfer Direction (only available for control endpoints) (Read/Write)" mask="0x00000080" name="DIR"/>
          <bitfield caption="Endpoint Type (Read/Write)" mask="0x00000700" name="EPTYPE" values="UDP_CSR__EPTYPE"/>
          <bitfield caption="Data Toggle (Read-only)" mask="0x00000800" name="DTGLE"/>
          <bitfield caption="Endpoint Enable Disable" mask="0x00008000" name="EPEDS"/>
          <bitfield caption="Number of Bytes Available in the FIFO (Read-only)" mask="0x07FF0000" name="RXBYTECNT"/>
        </register>
        <register caption="Endpoint FIFO Data Register 0" name="UDP_FDR" offset="0x50" rw="RW" size="4" count="6">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
