Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg55/atdf/ATSAMG55J19.atdf
        <register caption="Channel Status Register" name="US_CSR" offset="0x014" rw="R" size="4">
          <bitfield caption="Receiver Ready (cleared by reading US_RHR)" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready (cleared by writing US_THR)" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Break Received/End of Break (cleared by writing a one to the bit US_CR.RSTSTA)" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of RX Buffer (cleared by writing US_RCR or US_RNCR)" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of TX Buffer (cleared by writing US_TCR or US_TNCR)" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error (cleared by writing a one to the bit US_CR.RSTSTA)" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error (cleared by writing a one to the bit US_CR.RSTSTA)" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error (cleared by writing a one to the US_CR.RSTSTA)" mask="0x00000080" name="PARE"/>
          <bitfield caption="Receiver Time-out (cleared by writing a one to the bit US_CR.STTTO)" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty (cleared by writing US_THR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached (cleared by writing a one to the bit US_CR.RSTIT)" mask="0x00000400" name="ITER"/>
          <bitfield caption="TX Buffer Empty (cleared by writing US_TCR or US_TNCR)" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="RX Buffer Full (cleared by writing US_RCR or US_RNCR)" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non Acknowledge Interrupt (cleared by writing a one to the bit US_CR.RSTNACK)" mask="0x00002000" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Flag (cleared on read)" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Comparison Status (cleared by writing a one to the bit US_CR.RSTSTA command)" mask="0x00400000" name="CMP"/>
          <bitfield caption="Image of CTS Input" mask="0x00800000" name="CTS"/>
        </register>
        <register caption="Receive Holding Register" name="US_RHR" offset="0x018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000001FF" name="RXCHR"/>
          <bitfield caption="Received Sync" mask="0x00008000" name="RXSYNH"/>
        </register>
        <register caption="Transmit Holding Register" name="US_THR" offset="0x01C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000001FF" name="TXCHR"/>
          <bitfield caption="Sync Field to be Transmitted" mask="0x00008000" name="TXSYNH"/>
        </register>
        <register caption="Baud Rate Generator Register" name="US_BRGR" offset="0x020" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x0000FFFF" name="CD"/>
          <bitfield caption="Fractional Part" mask="0x00070000" name="FP"/>
        </register>
        <register caption="Receiver Time-out Register" name="US_RTOR" offset="0x024" rw="RW" size="4">
          <bitfield caption="Time-out Value" mask="0x0001FFFF" name="TO"/>
        </register>
        <register caption="Transmitter Timeguard Register" name="US_TTGR" offset="0x028" rw="RW" size="4">
          <bitfield caption="Timeguard Value" mask="0x000000FF" name="TG"/>
        </register>
        <register caption="FI DI Ratio Register" name="US_FIDI" offset="0x040" rw="RW" size="4">
          <bitfield caption="FI Over DI Ratio Value" mask="0x0000FFFF" name="FI_DI_RATIO"/>
        </register>
        <register caption="Number of Errors Register" name="US_NER" offset="0x044" rw="R" size="4">
          <bitfield caption="Number of Errors" mask="0x000000FF" name="NB_ERRORS"/>
        </register>
        <register caption="IrDA Filter Register" name="US_IF" offset="0x04C" rw="RW" size="4">
          <bitfield caption="IrDA Filter" mask="0x000000FF" name="IRDA_FILTER"/>
        </register>
        <register caption="LIN Mode Register" name="US_LINMR" offset="0x054" rw="RW" size="4">
          <bitfield caption="LIN Node Action" mask="0x00000003" name="NACT" values="US_LINMR__NACT"/>
          <bitfield caption="Parity Disable" mask="0x00000004" name="PARDIS"/>
          <bitfield caption="Checksum Disable" mask="0x00000008" name="CHKDIS"/>
          <bitfield caption="Checksum Type" mask="0x00000010" name="CHKTYP"/>
          <bitfield caption="Data Length Mode" mask="0x00000020" name="DLM"/>
          <bitfield caption="Frame Slot Mode Disable" mask="0x00000040" name="FSDIS"/>
          <bitfield caption="Wakeup Signal Type" mask="0x00000080" name="WKUPTYP"/>
          <bitfield caption="Data Length Control" mask="0x0000FF00" name="DLC"/>
          <bitfield caption="PDC Mode" mask="0x00010000" name="PDCM"/>
          <bitfield caption="Synchronization Disable" mask="0x00020000" name="SYNCDIS"/>
        </register>
        <register caption="LIN Identifier Register" name="US_LINIR" offset="0x058" rw="RW" size="4">
          <bitfield caption="Identifier Character" mask="0x000000FF" name="IDCHR"/>
        </register>
        <register caption="LIN Baud Rate Register" name="US_LINBRR" offset="0x05C" rw="R" size="4">
          <bitfield caption="Clock Divider after Synchronization" mask="0x0000FFFF" name="LINCD"/>
          <bitfield caption="Fractional Part after Synchronization" mask="0x00070000" name="LINFP"/>
        </register>
        <register caption="Comparison Register" name="US_CMPR" offset="0x090" rw="RW" size="4">
          <bitfield caption="First Comparison Value for Received Character" mask="0x000001FF" name="VAL1"/>
          <bitfield caption="Comparison Mode" mask="0x00001000" name="CMPMODE" values="US_CMPR__CMPMODE"/>
          <bitfield caption="Compare Parity" mask="0x00004000" name="CMPPAR"/>
          <bitfield caption="Second Comparison Value for Received Character" mask="0x01FF0000" name="VAL2"/>
        </register>
